<?php

/**
 * @charset UTF-8
 *
 * Задание 2. Работа с массивами и строками.
 *
 * Есть список временных интервалов (интервалы записаны в формате чч:мм-чч:мм).
 *
 * Необходимо написать две функции:
 *
 *
 * Первая функция должна проверять временной интервал на валидность
 * 	принимать она будет один параметр: временной интервал (строка в формате чч:мм-чч:мм)
 * 	возвращать boolean
 *
 *
 * Вторая функция должна проверять "наложение интервалов" при попытке добавить новый интервал в список существующих
 * 	принимать она будет один параметр: временной интервал (строка в формате чч:мм-чч:мм)
 *  возвращать boolean
 *
 *  "наложение интервалов" - это когда в промежутке между началом и окончанием одного интервала,
 *   встречается начало, окончание или то и другое одновременно, другого интервала
 *
 *  пример:
 *
 *  есть интервалы
 *  	"10:00-14:00"
 *  	"16:00-20:00"
 *
 *  пытаемся добавить еще один интервал
 *  	"09:00-11:00" => произошло наложение
 *  	"11:00-13:00" => произошло наложение
 *  	"14:00-16:00" => наложения нет
 *  	"14:00-17:00" => произошло наложение
 */

# Можно использовать список:

$list = array (
	'09:00-11:00',
	'11:00-13:00',
	'15:00-16:00',
	'17:00-20:00',
	'20:30-21:30',
	'21:30-22:30',
);

// Решение

/**
 * Проверяет временной интервал на валидность
 * 
 * @param string $interval	проверяемый временной интервал
 * @return boolean
 */
function validate_time_interval($interval)
{
	return preg_match('/^(?:2[0-3]|[01][0-9]):[0-5][0-9]-(?:2[0-3]|[01][0-9]):[0-5][0-9]$/', $interval);
}

/**
 * Проверяет наложение нового временного интервала с существующими
 * 
 * @param string $new_interval		новый интервал
 * @return string					результат проверки
 */
function check_new_time_overlay($new_interval)
{
	$list = array ( 	// Список интервалов для сравнения
		"10:00-14:00",
 	  	"16:00-20:00"
	);

	/**
	 * Проверяет наложение двух указанных временных интервалов
	 * 
	 * @param string $interval1		первый временной интервал
	 * @param string $interval2		второй временной интервал
	 * @return boolean
	 */
	function check_time_overlay($interval1, $interval2)
	{
		$time1 = strtotime(substr($interval1, 0, 5));
		$time2 = strtotime(substr($interval1, 6));
		$time3 = strtotime(substr($interval2, 0, 5));
		$time4 = strtotime(substr($interval2, 6));
		
		if ($time1<$time4 && $time3<$time2)
			return true;
		else if ($time3<$time2 && $time1<$time4)
			return true;
		else if ($time1<$time3 && $time4<$time2)
			return true;
		else if ($time3<$time1 && $time2<$time4)
			return true;
		else
			return false;
	}

	if (validate_time_interval($new_interval)) { 				// Если проверяемый интервал указан верно
		foreach($list as $i) {									// Для каждого интервала из списка
			$overlay = check_time_overlay($i, $new_interval);	// проверяем наложение
			if ($overlay == true)								// Если оно есть,
				return 'произошло наложение';					// выводим нужную строку
		}
		return 'наложения нет';									
	} else {													// Если интервал указан неверно,
		echo 'Неверно указан интервал';							// выводим соответствующее сообщение
	}
	
}

echo check_new_time_overlay("14:00-17:00");
?>
